phone = '<b>🤞 Для доступа к полному функционалу разрешите посмотреть номер телефона?</b>'

introduction = (
    '<b>✨ Чат бот предназначен для отслеживания строительства новостроек '
    'и изменений сроков строительства</b>\n\n'
    '😱 Вы можете:\n'
    '- Подписаться на обновления по любым ЖК\n'
    '- Перейти в каталог квартир и коммерции в новостройках\n'
    '- Задать вопрос менеджеру отдела продаж'
    f'\n\n{phone}'
)

help = (
    'Бот, в котором можно задать вопросы менеджеру\n'
    '   <code><b>Ссылка</b></code>'
)

auth_finished = (
    '<b>Отлично!</b>\n'
    'Можете использовать логин и пароль для входа в свой личный кабинет на сайте Bashni.pro\n\n'
    'Также вы можете подписаться на ЖК, чтобы получать актуальные новости\n'
    '<b>Подписаться❔</b>'
)

flats = (
    'Каталог квартир интегрирован с сайтами застройщиков: актуальное наличие, цены застройщиков, бесплатное сопровождение от bashni.pro\n'
    '  1.	Выберите понравившуюся планировку\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Помощь с одобрением ипотеки\n'
    '  5.	Бронирование квартиры и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    '  7.	Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог квартир\n\n'
    'Владивосток (https://bashni.pro/property/vladivostok/flats/)\n'
    'Уссурийск (https://bashni.pro/property/ussurijsk/flats/ )'
)

offices = (
    'В каталоге представлены коммерческие помещения для ведения бизнеса в новостройках.\n'
    '  1.	Выберите понравившееся помещение\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Согласовываем условия оплаты\n'
    '  5.	Бронирование помещения и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    'Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог помещений\n'
    'Владивосток (https://bashni.pro/property/vladivostok/commercial/ )'
)

login_tip = (
    '<b>Логин должен содержать не менее 6 и не более 15 символов.</b>\n'
    '<b>Только латинские буквы, нижний дефис и цифры.</b>'
)

password_tip = (
    '<b>Пароль не должен быть слишком похож на другую вашу личную информацию.</b>\n'
    '<b>Ваш пароль должен содержать как минимум 8 символов.</b>'
)

email_tip = (
    'Не похоже, что это существующий email.\nПопробуйте снова'
)