from enum import Enum
from config import Config

config = Config()
manager = config.MANAGER_LINK

class Btn(Enum):
    START = '/start'
    MENU = '🔹 Меню 🔹'
    FLATS = 'Каталог квартир 🏡'
    OFFICES = 'Помещения для бизнеса 🏢'
    SUBSCRIPTION = 'Фотоотчеты ✅'
    HELP = 'Вопрос менеджеру 💬'
    BACK = 'Назад ⏪'
    SKIP = 'Пропустить ⏩'
    SUBSCRIBE = 'Подписаться 🔔'
    NEW_SUBSCRIPTION = 'Новая подписка ➕'
    REMOVE_SUBSCRIPTION = 'Отписаться 🗑️'
    SUBSCRIPTION_LIST = 'Список подписок📖'
    TO_MENU = 'В главное меню ⏪'
    AUTH = 'Перейти на сайт 🔑'

class Error(Enum):
    user_exists = 'Пользователь с таким же именем уже существует'

phone = '<b>🤞 Для доступа к полному функционалу разрешите посмотреть номер телефона?</b>'
phone_error = '🔹 Ниже есть кнопка Разрешить\nНажмите для предоставления доступа'
phone_button = 'РАЗРЕШИТЬ'

introduction = (
    '<b>Вас приветствует Сервис недвижимости Bashni.pro</b>\n'
    '<b>✨ Чат бот предназначен для отслеживания строительства новостроек '
    'и изменений сроков строительства</b>\n\n'
    '😱 Вы можете:\n'
    '- Подписаться на обновления по любым ЖК\n'
    '- Перейти в каталог квартир и коммерции в новостройках\n'
    '- Задать вопрос менеджеру отдела продаж'
    f'\n\n{phone}'
)

help = (
    'Задать вопросы вы можете в чате с менеджером\n'
    f'{manager}'
)

error = (
    f'Возникла ошибка! Сообщите, пожалуйста, об этом <b>менеджеру</b> {manager}\n'
    '<i>Не забудьте прикрепить скриншоты переписки с telegram ботом</i>'
)

auth = f"✅Вы успешно авторизованы на <a href='https://bashni.pro'>bashni.pro</a>"
auth_btn = 'ПЕРЕЙТИ НА САЙТ'

flats = (
    'Каталог квартир интегрирован с сайтами застройщиков: актуальное наличие, цены застройщиков, бесплатное сопровождение от bashni.pro\n'
    '  -	Выберите понравившуюся планировку\n'
    '  -	Оставьте заявку\n'
    '  -	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  -	Помощь с одобрением ипотеки\n'
    '  -	Бронирование квартиры и выход на сделку\n'
    '  -	Все услуги оказываются бесплатно\n'
    '  -	Возможно онлайн встреча и сделка\n'
    '  -    Добавляйте квартиры в Избранное и отслеживайте изменение цены\n\n'
    'Перейти в каталог квартир:\n'
)

offices = (
    'В каталоге представлены коммерческие помещения для ведения бизнеса в новостройках.\n'
    '  -	Выберите понравившееся помещение\n'
    '  -	Оставьте заявку\n'
    '  -	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  -	Согласовываем условия оплаты\n'
    '  -	Бронирование помещения и выход на сделку\n'
    '  -	Все услуги оказываются бесплатно\n'
    'Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог помещений:\n'
    f'<a href="{config.DJANGO_HOST}/property/vladivostok/commercial/">Владивосток</a>'
)

choose_email = 'Введите адрес электронной почты:'
email_tip = 'Не похоже, что это существующий email.\nПопробуйте снова'

subscriptions = 'Действующие подписки:'
subscription_menu = 'Меню управления подписками:'
subscription_success = '<b>Подписка оформлена успешно!</b>\nПросматривать подписки можно во вкладке Подписки/Список подписок'
subscription_remove = 'Выберите ЖК, от которого хотите отписаться:'
subscription_empty = f'<b>У вас нет активных подписок</b>\nНо это легко исправить! Просто нажмите на {Btn.NEW_SUBSCRIPTION.value}'
subscription_remove_success = 'Мы удалили вашу подписку'

choose_house = 'Выберите номер дома:'
choose_house_error = 'Выберите номер дома из списка:'

choose_city = 'Выберите город:'
choose_city_error = 'Выберите город из списка:'

choose_property = (
    'На новости какого ЖК вы хотите подписаться:'
    '\n🔹 Можно написать примерное название и выбрать из предложенных'
)
choose_exact_property = 'Выберите ЖК из предложенных\nИли напишите другое название:'
choose_property_error = 'Выберите ЖК из списка:'
no_property = 'В этом городе пока нет доступных ЖК'