introduction = (
    'Чат бот предназначен для отслеживания строительства новостроек, '
    'изменений сроков строительства.\n'
    'Пользователь бота может подписаться на обновления по любым ЖК, '
    'перейти в каталог квартир и коммерции в новостройках или задать вопрос менеджеру отдела продаж.'
    '\n\nДля доступа к полному функционалу разрешите воспользоваться вашим номер телефона'
)

help = (
    'Бот, в котором можно задать вопросы менеджеру\n'
    '   <<Ссылка>>'
)

auth_finished = (
    f'Отлично! Теперь под этим логином и паролем вы можете входить в свой личный кабинет на сайте Bashni.pro\n'
    'Также вы можете подписаться на ЖК, чтобы получать актуальные новости\n'
    'Подписаться?'
)

flats = (
    'Каталог квартир интегрирован с сайтами застройщиков: актуальное наличие, цены застройщиков, бесплатное сопровождение от bashni.pro\n'
    '  1.	Выберите понравившуюся планировку\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Помощь с одобрением ипотеки\n'
    '  5.	Бронирование квартиры и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    '  7.	Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог квартир\n\n'
    'Владивосток (https://bashni.pro/property/vladivostok/flats/)\n'
    'Уссурийск (https://bashni.pro/property/ussurijsk/flats/ )'
)

offices = (
    'В каталоге представлены коммерческие помещения для ведения бизнеса в новостройках.\n'
    '  1.	Выберите понравившееся помещение\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Согласовываем условия оплаты\n'
    '  5.	Бронирование помещения и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    'Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог помещений\n'
    'Владивосток (https://bashni.pro/property/vladivostok/commercial/ )'
)

login_tip = (
    'Логин должен содержать не менее 6 и не более 15 символов.\n'
    'Только латинские буквы, нижний дефис и цифры.'
)

password_tip = (
    'Пароль не должен быть слишком похож на другую вашу личную информацию.\n'
    'Ваш пароль должен содержать как минимум 8 символов.'
)