from enum import Enum
from config import Config

manager_bot = Config().MANAGER_BOT_LINK

class Btn(Enum):
    MENU = '🔹 Меню 🔹'
    FLATS = 'Каталог квартир 🏡'
    OFFICES = 'Помещения для бизнеса 🏢'
    PROFILE = 'Мой профиль 👤'
    SUBSCRIPTION = 'Подписки ✅'
    HELP = 'Помощь 💬'
    BACK = 'Назад ⏪'
    EDIT = 'Создать профиль ✏'
    SKIP = 'Пропустить ⏩'
    SUBSCRIBE = 'Подписаться 🔔'
    NEW_SUBSCRIPTION = 'Новая подписка ➕'
    REMOVE_SUBSCRIPTION = 'Отписаться 🗑️'
    SUBSCRIPTION_LIST = 'Список подписок📖'
    TO_MENU = 'В главное меню ⏪'
    NO_EDIT_PASSWORD = 'Оставить прежний ⏩'

class Error(Enum):
    user_exists = 'Пользователь с таким же именем уже существует'


phone = '<b>🤞 Для доступа к полному функционалу разрешите посмотреть номер телефона?</b>'

introduction = (
    '<b>Ваш приветсвует Сервис недвижимости Bashni.pro</b>\n'
    '<b>✨ Чат бот предназначен для отслеживания строительства новостроек '
    'и изменений сроков строительства</b>\n\n'
    '😱 Вы можете:\n'
    '- Подписаться на обновления по любым ЖК\n'
    '- Перейти в каталог квартир и коммерции в новостройках\n'
    '- Задать вопрос менеджеру отдела продаж'
    f'\n\n{phone}'
)

help = (
    f'<a href="{manager_bot}"><b>Консультант по новостойкам Bashni.pro</b></a>\n'
    'Бот, в котором можно задать вопросы менеджеру\n'
)

error = (
    f'Возникла ошибка! Сообщите, пожалуйста, об этом <a href = "{manager_bot}"><b>менеджеру</b></a>\n'
    '<i>Не забудьте прикрепить скриншоты переписки с telegram ботом</i>'
)

auth_finished = (
    '<b>Отлично!</b>\n'
    'Можете использовать логин и пароль для входа в свой личный кабинет на сайте Bashni.pro\n\n'
    'Также вы можете подписаться на ЖК, чтобы получать актуальные новости\n'
    '<b>Подписаться❔</b>'
)

flats = (
    'Каталог квартир интегрирован с сайтами застройщиков: актуальное наличие, цены застройщиков, бесплатное сопровождение от bashni.pro\n'
    '  1.	Выберите понравившуюся планировку\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Помощь с одобрением ипотеки\n'
    '  5.	Бронирование квартиры и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    '  7.	Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог квартир:\n'
)

offices = (
    'В каталоге представлены коммерческие помещения для ведения бизнеса в новостройках.\n'
    '  1.	Выберите понравившееся помещение\n'
    '  2.	Оставьте заявку\n'
    '  3.	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  4.	Согласовываем условия оплаты\n'
    '  5.	Бронирование помещения и выход на сделку\n'
    '  6.	Все услуги оказываются бесплатно\n'
    'Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог помещений:\n'
    f'<a href="{Config().DJANGO_HOST}property/vladivostok/commercial/">Владивосток</a>'
)

login_preview = (
    '<b>Создайте свой профиль, чтобы подписаться на новостные обновления по вашему ЖК:</b>\n'
)

login_tip = (
    '<b>🔹 Логин должен содержать не менее 6 и не более 15 символов.</b>\n'
    '<b>🔹 Только латинские буквы, нижний дефис и цифры.</b>'
)

password_tip = (
    '<b>🔹 Пароль не должен быть слишком похож на другую вашу личную информацию.</b>\n'
    '<b>🔹 Ваш пароль должен содержать как минимум 8 символов.</b>'
)
password_disclaimer = '\nПАРОЛЬ ОБЯЗАТЕЛЬНО НУЖНО ЗАПОМНИТЬ!'

choose_email = 'Введите адрес электронной почты:'
email_tip = 'Не похоже, что это существующий email.\nПопробуйте снова'

phone_error = 'Не похоже на номер телефона, попробуйте еще раз'

subscriptions = 'Действующие подписки:'
subscription_menu = 'Меню управления подписками:'
subscription_success = '<b>Подписка оформлена успешно!</b>\nПросматривать подписки можно во вкладке Подписки/Список подписок'
subscription_remove = 'Выберите ЖК, от которого хотите отписаться:'
subscription_empty = f'<b>У вас нет активных подписок</b>\nНо это легко исправить! Просто нажмите на {Btn.NEW_SUBSCRIPTION.value}'
subscription_remove_success = 'Мы удалили вашу подписку'

choose_house = 'Выберите номер дома:'
choose_house_error = 'Выберите номер дома из списка:'

choose_city = 'Выберите город:'
choose_city_error = 'Выберите город из списка:'

choose_property = (
    'На новости какого ЖК вы хотите подписаться:'
    '\n🔹 Можно написать примерное название и выбрать из предложенных'
)
choose_exact_property = 'Выберите ЖК из предложенных\nИли напишите другое название:'
choose_property_error = 'Выберите ЖК из списка:'
no_property = 'В этом городе пока нет доступных ЖК'

please_login = f'Чтобы открыть доступ к подпискам на новостные обновления по ЖК, <b>создайте профиль ✏</b>'
login_empty = '<i>🔹 Вы можете <b>создать профиль</b> и получить доступ к новостным обновлениям по ЖК</i>'