from enum import Enum
from internal.config import Config

config = Config()
manager = config.MANAGER_LINK

class Btn(Enum):
    START = '/start'
    MENU = '🔹 Меню 🔹'
    FLATS = 'Каталог квартир 🏡'
    OFFICES = 'Помещения для бизнеса 🏢'
    SUBSCRIPTION = 'Фотоотчеты ✅'
    HELP = 'Вопрос менеджеру 💬'
    BACK = 'Назад ⏪'
    SKIP = 'Пропустить ⏩'
    SUBSCRIBE = 'Подписаться 🔔'
    NEW_SUBSCRIPTION = 'Новая подписка ➕'
    REMOVE_SUBSCRIPTION = 'Отписаться 🗑️'
    SUBSCRIPTION_LIST = 'Список подписок📖'
    TO_MENU = 'В главное меню ⏪'
    AUTH = 'Перейти на сайт 🔑'

class Phone(Enum):
    ERROR = '🔹 Ниже есть кнопка Разрешить\nНажмите для предоставления доступа'
    BUTTON = 'РАЗРЕШИТЬ'

class Email(Enum):
    FILL = 'Введите адрес электронной почты:'
    TIP = 'Не похоже, что это существующий email.\nПопробуйте снова'

class Auth(Enum):
    SUCCESS = f"✅Вы успешно авторизованы на <a href='https://bashni.pro'>bashni.pro</a>"
    BUTTON = 'ПЕРЕЙТИ НА САЙТ'

class Subscription(Enum):
    CURRENT = 'Действующие подписки:'
    MENU = 'Меню управления подписками:'
    SUCCESS = '<b>Подписка оформлена успешно!</b>\nПросматривать подписки можно во вкладке Подписки/Список подписок'
    REMOVE = 'Выберите ЖК, от которого хотите отписаться:'
    REMOVE_SUCCESS = 'Подписка успешно удалена!'
    EMPTY = f'<b>У вас нет активных подписок</b>\nНо это легко исправить! Просто нажмите на {Btn.NEW_SUBSCRIPTION.value}'

class City(Enum):
    CHOICE = 'Выберите город:'
    ERROR = 'Выберите город из списка:'

class Property(Enum):
    CHOICE = (
        'На новости какого ЖК вы хотите подписаться:'
        '\n🔹 Можно написать примерное название и выбрать из предложенных'
    )
    ERROR = 'Выберите ЖК из предложенных\nИли напишите другое название:'
    ERROR2 = 'Выберите ЖК из предложенных:'
    EMPTY = 'В этом городе пока нет доступных ЖК'
    
class House(Enum):
    CHOICE = 'Выберите номер дома:'
    ERROR = 'Выберите номер дома из списка:'

introduction = (
    '<b>Вас приветствует Сервис недвижимости Bashni.pro</b>\n'
    '<b>✨ Чат бот предназначен для отслеживания строительства новостроек '
    'и изменений сроков строительства</b>\n\n'
    '😱 Вы можете:\n'
    '- Подписаться на обновления по любым ЖК\n'
    '- Перейти в каталог квартир и коммерции в новостройках\n'
    '- Задать вопрос менеджеру отдела продаж\n\n'
    '<b>🤞 Для доступа к полному функционалу разрешите посмотреть номер телефона?</b>'
)

help = (
    'Задать вопросы вы можете в чате с менеджером\n'
    f'{manager}'
)

error = (
    f'Возникла ошибка! Сообщите, пожалуйста, об этом <b>менеджеру</b> {manager}\n'
    '<i>Не забудьте прикрепить скриншоты переписки с telegram ботом</i>'
)

flats = (
    'Каталог квартир интегрирован с сайтами застройщиков: актуальное наличие, цены застройщиков, бесплатное сопровождение от bashni.pro\n'
    '  -	Выберите понравившуюся планировку\n'
    '  -	Оставьте заявку\n'
    '  -	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  -	Помощь с одобрением ипотеки\n'
    '  -	Бронирование квартиры и выход на сделку\n'
    '  -	Все услуги оказываются бесплатно\n'
    '  -	Возможно онлайн встреча и сделка\n'
    '  -    Добавляйте квартиры в Избранное и отслеживайте изменение цены\n\n'
    'Перейти в каталог квартир:\n'
)

offices = (
    'В каталоге представлены коммерческие помещения для ведения бизнеса в новостройках.\n'
    '  -	Выберите понравившееся помещение\n'
    '  -	Оставьте заявку\n'
    '  -	Отдел продаж Bashni.pro назначает дату встречи\n'
    '  -	Согласовываем условия оплаты\n'
    '  -	Бронирование помещения и выход на сделку\n'
    '  -	Все услуги оказываются бесплатно\n'
    'Возможно онлайн встреча и сделка\n\n'
    'Перейти в каталог помещений:\n'
    f'<a href="{config.DJANGO_HOST}/property/vladivostok/commercial/">Владивосток</a>'
)